Autodesk.Revit.DB.IndependentTag
Represents tag annotations in Revit.
Remarks:
IndependentTag represents single-category tags, multi-category tags, material tags, and zone tags.
IndependentTag is also the base class for other annotations like keynote tags and span symbols.
Room, area and space tags are not derived from IndependentTag.  Autodesk.Revit.DB.SpatialElementTag for more information.